Config.org
#+title: Emacs configuration
#+author: esedev
#+startup: overview

* =--Emacs-files---------------------------=
* early-init.el
#+name: early-init.el
#+begin_src emacs-lisp :noweb yes :tangle early-init.el
;;; early-init.el --- Emacs init script  -*- lexical-binding: t; -*-
;;; Commentary:
<<data--early-init-comment>>
;;; Code:
;;;;; debug
(when init-file-debug
  (trace-function 'require)
  (trace-function 'load)
  ;; (trace-function 'package-initialize)
  ;; (trace-function 'custom-initialize-reset)
  ;; (require 'edebug)
  ;; (edebug-trace "CFG: start early-init.el")
  )

;;;;; processing extended command line arguments with '--u-' prefix
(when t
  (require 'cl-seq)
  (let ((u-args (cl-remove-if-not
                 (lambda (e) (string-prefix-p "--u-" e))
                 command-line-args)))
    (dolist (a u-args)
      (when-let ((arg-lst (split-string a "="))
                 (opt (substring (car arg-lst) 4 nil))
                 (var (concat "EMAX_" (upcase opt)))
                 (val (car (cdr arg-lst))))
        (setenv var val)))
    (cl-delete-if (lambda (e) (string-prefix-p "--u-" e)) command-line-args)))

;;;;; initialize config variables
(defvar cfg/profile (intern (or (getenv "EMAX_PRF") "actual"))
  "User Emacs profile identity.")
(defvar cfg/job (getenv "EMAX_JOB") "Job identity, type string.")
(defvar cfg/directory user-emacs-directory "Path to config directory.")
(defvar cfg/frame-title (format "%s%s☀%s" cfg/profile
                                (if cfg/job (concat "-" cfg/job) "")
                                system-name) "Emacs frame title.")

;;;;; paths for clean and order
(defun cfg/path (arg)                   ; ~/.config/emacs/$arg
  "Return full path file ARG in `cfg/directory'."
  (expand-file-name arg cfg/directory))
(defun cfg/path-s (arg)                 ; ~/.config/emacs/save/$arg
  (cfg/path (concat "save/" arg)))

(setq user-emacs-directory (cfg/path "target"))

(defun cfg/path-u (arg)                 ; ~/.config/emacs/target/$arg
  "Return full path file ARG in `user-emacs-directory'."
  (expand-file-name arg user-emacs-directory))
(defun cfg/path-p (arg)                 ; ~/.config/emacs/target/prf--%name%/$arg
  "Return full profile path file ARG in `user-emacs-directory'."
  (cfg/path-u (format "prf--%s/%s" cfg/profile arg)))

(setq package-user-dir (cfg/path-p "elpa"))
(when (boundp 'native-comp-eln-load-path) ; set eln-cache dir
  (startup-redirect-eln-cache (cfg/path-p "eln-cache")))

(setq custom-file (cfg/path-s (format "custom-file-%s.el" cfg/profile)))

;;;;; micro tuning
;; (setq frame-title-format '( "GNU/Emacs " title))
(setq frame-title-format
      '("GNU/Emacs"
        (:eval (if tab-bar-mode
                   (concat " ___/ " (cdr (assq 'name (tab-bar--current-tab))) " \\___ ") ""))
        "<" cfg/frame-title ">"))

;;;;; performance
(setq gc-cons-threshold (* 64 1024 1024)) ; run gc after threshold
(setq read-process-output-max (* 1 1024 1024)) ; performance with language servers
(setenv "LSP_USE_PLISTS" "true") ; tree-sitter performance enhancement
;; (setq lsp-use-plists t)          ;

;;;;;
(setq package-enable-at-startup nil)    ; must be called explicitly (package-initialize)


(provide 'early-init)
;;; early-init.el ends here
#+end_src
* init.el
#+begin_src emacs-lisp :noweb yes :tangle init.el
;;; init.el --- Emacs init script  -*- lexical-binding: t; -*-

;;; Commentary:

;;; Code:
(when (< emacs-major-version 30)
  (error "Minimum required Emacs version 30, current %s" emacs-major-version))
(eval-when-compile
  (require 'use-package))
;;;;; begin of configure package manager
(use-package package
  :ensure nil
  :custom
  (package-native-compile t)
  (package-archives '(("gnu"   . "https://elpa.gnu.org/packages/")
                      ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                      ("melpa-stable" . "https://stable.melpa.org/packages/")
                      ("melpa" . "https://melpa.org/packages/")))
  (package-archive-priorities '(("gnu" . 10) ("nongnu" . 9)
                                ("melpa-stable" . 7) ("melpa" . 1)))
  :config
  (package-initialize)                  ; must have
  (when (eq cfg/profile 'built-in)
      (setq package-archives nil)))
(use-package use-package
  :ensure nil
  :custom
  ;; (use-package-always-defer t)
  (use-package-minimum-reported-time 0.05)
  (use-package-verbose nil))
;;;;; end of configure package manager
;;; performance
(add-hook 'emacs-startup-hook
          (lambda ()
            (let ((mb (if (display-graphic-p) 8 1)))
              (setq gc-cons-threshold (* mb 1024 1024)))
            (message "Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f") gcs-done))
          100)


<<lisp--init>>
;;; load profile
(load (cfg/path (format "init/init-%s" cfg/profile)))

(provide 'init)
;;; init.el ends here
#+end_src
* =--Profiles------------------------------=
* init/init-actual.el
#+begin_src emacs-lisp :noweb yes :tangle init/init-actual.el
;;; init-actual.el --- Default Emacs init script  -*- lexical-binding: t; -*-
<<data--copyright>>
<<data--license-gpl-v3>>
;;; Commentary:
;; This config use only good work things

;;; Code:
<<role--built-in--core>>
<<role--navi--vertico>>
<<role--emacs>>
<<role--ide-native>>

(provide 'init-actual)
;;; init-actual.el ends here
#+end_src
* init/init-built-in.el
#+begin_src emacs-lisp :noweb yes :tangle init/init-built-in.el
;;; init-built-in.el --- Minimalistic Emacs config  -*- lexical-binding: t; -*-
<<data--copyright>>
<<data--license-gpl-v3>>
;;; Commentary:
;; This config use only built-in packages

;;; Code:
<<role--built-in--core>>
<<role--built-in--ide>>

(cfg//setup--ido-mode)

(provide 'init-built-in)
;;; init-built-in.el ends here
#+end_src
* init/init-craft.el
#+begin_src emacs-lisp :noweb yes :tangle init/init-craft.el
;;; init-craft.el --- Emacs config like IDE  -*- lexical-binding: t; -*-
<<data--copyright>>
<<data--license-gpl-v3>>
;;; Commentary:
;; This config use good work things for development

;;; Code:
<<role--built-in--core>>
<<role--navi--vertico>>
<<role--emacs>>
<<role--ide-lsp>>

(killless-mode t) ; protect from accidentally closing

(provide 'init-craft)
;;; init-craft.el ends here
#+end_src
* init/init-devel.el
#+begin_src emacs-lisp :noweb yes :tangle init/init-devel.el
;;; init-devel.el --- Experimental Emacs config  -*- lexical-binding: t; -*-
<<data--copyright>>
<<data--license-gpl-v3>>
;;; Commentary:
;; This config used for experiments with emacs configuration

;;; Code:
<<role--built-in--core>>
<<role--navi--vertico>>
;; <<pckg--hydra>>
;; <<suit--emacs-editor>>
<<role--emacs>>

<<role--experimental>>
<<role--yard-of-test>>

(provide 'init-devel)
;;; init-devel.el ends here
#+end_src
* =--Lisp----------------------------------=
* lisp--init
#+name: lisp--init
#+begin_src emacs-lisp :noweb yes :results silent
<<lisp--cfg-setup>>
(cfg//setup--override-keybindings)

<<mode--killless-mode>>
;;; remap keybindings
<<bind--minor-maps>>
<<bind--major-map>>
<<bind--craft-map>>
<<bind--agile-map>>
<<mode--emax-hk-mode>>
(emax-hk-mode 1)

<<thms--initialize>>
;;; customize
<<cstm--user-env>>
(if (file-exists-p custom-file)
    (load custom-file)
  (progn
    <<cstm--default>>
    <<cstm--electric-pairs>>
    ))
<<lisp--emacs-customize>>
<<lisp--cfg-functions>>
<<lisp--emax>>
;;;
(load (cfg/path "data/help-quick-custom"))
#+end_src
