init.el
;;; init.el --- Emacs init script  -*- lexical-binding: t; -*-

;;; Commentary:

;;; Code:
(when (< emacs-major-version 30)
  (error "Minimum required Emacs version 30, current %s" emacs-major-version))
(eval-when-compile
  (require 'use-package))
;;;;; begin of configure package manager
(use-package package
  :ensure nil
  :custom
  (package-native-compile t)
  (package-archives '(("gnu"   . "https://elpa.gnu.org/packages/")
                      ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                      ("melpa-stable" . "https://stable.melpa.org/packages/")
                      ("melpa" . "https://melpa.org/packages/")))
  (package-archive-priorities '(("gnu" . 10) ("nongnu" . 9)
                                ("melpa-stable" . 7) ("melpa" . 1)))
  :config
  (package-initialize)                  ; must have
  (when (eq cfg/profile 'built-in)
      (setq package-archives nil)))
(use-package use-package
  :ensure nil
  :custom
  ;; (use-package-always-defer t)
  (use-package-minimum-reported-time 0.05)
  (use-package-verbose nil))
;;;;; end of configure package manager
;;; performance
(add-hook 'emacs-startup-hook
          (lambda ()
            (let ((mb (if (display-graphic-p) 8 1)))
              (setq gc-cons-threshold (* mb 1024 1024)))
            (message "Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f") gcs-done))
          100)


;;;
;;; lisp--cfg-setup
;;;
