Config.org
* lisp--cfg-setup
#+name: lisp--cfg-setup
#+begin_src emacs-lisp :noweb yes :results silent
;;;
;;; lisp--cfg-setup
;;;
(defun cfg//setup--override-keybindings ()
  <<bind--override-standard>>
  )
(defun cfg//setup--ido-mode ()
  (ido-mode 1)
  (setf (nth 2 ido-decorations) "\n")
  (setq ido-enable-flex-matching t) ; show any name that has the chars you typed
  (setq ido-default-file-method 'selected-window) ; use current pane for newly opened file
  (setq ido-default-buffer-method 'selected-window) ; use current pane for newly switched buffer
  (setq max-mini-window-height 0.5) ; big minibuffer height, for ido to show choices vertically
  )
(defun cfg//setup--remap-major-modes ()
  (push '(ruby-mode ruby-ts-mode) major-mode-remap-alist)
  (push '(rust-mode rust-ts-mode) major-mode-remap-alist))
#+end_src
* lisp--emacs-customize
#+name: lisp--emacs-customize
#+begin_src emacs-lisp :results silent
;;;
;;; lisp--emacs-customize
;;;
(when (and (display-graphic-p (selected-frame)) (eq cfg/profile 'craft))
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))
  (setopt cursor-type 'hollow))
;;; remap tree-sitter modes
(setq major-mode-remap-alist
      '((bash-mode . bash-ts-mode)
        (css-mode . css-ts-mode)
        (js2-mode . js-ts-mode)
        (json-mode . json-ts-mode)
        (typescript-mode . typescript-ts-mode)
        (python-mode . python-ts-mode)
        (yaml-mode . yaml-ts-mode)))
;;;;; hightlight line off
(dolist (m-hook '(eshell-mode-hook
                  term-mode-hook
                  shell-mode-hook))
  (add-hook m-hook (lambda () (hl-line-mode 0))))
;;;;; display-line-numbers off
(dolist (m-hook '(eshell-mode-hook
                  eww-mode-hook
                  org-mode-hook
                  minimap-sb-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  spacious-padding-mode-hook
                  w3m-mode-hook))
  (add-hook m-hook (lambda () (display-line-numbers-mode 0))))
;;;;; folding code
(add-hook 'prog-mode-hook #'hs-minor-mode)
#+end_src
* lisp--cfg-functions
#+name: lisp--cfg-functions
#+begin_src emacs-lisp :results silent
;;;
;;; lisp--cfg-functions
;;;
(defun cfg/toggle-tab-bar-headers-visible (&optional visible)
  "Show/hide headers of tab bar.
   If argument VISIBLE is nil, then toggle visible of headers.
   If argument VISIBLE <= 0, then hide headers.
   If argument VISIBLE > 0, then show headers."
  (interactive)
  (let ((tbs (if visible (if ; <
                             (> visible 0) t 100)
               (if (eq tab-bar-show t) 100 t))))
    (customize-set-variable 'tab-bar-show tbs))
  (eq tab-bar-show t))
  #+end_src
* lisp--emax
#+name: lisp--emax
#+begin_src emacs-lisp :results silent
(defun emax-sh (command)
  "Run `start-process-shell-command' with COMMAND.
NAME   set to \"sh:COMMAND\"
BUFFER set to \"bf:COMMAND\"
"
  (interactive "sCommand: ")
  (let ((name (concat "process: " command))
        (buff (concat "bash: " command)))
    (start-process-shell-command name buff command)
    (display-buffer buff)))
#+end_src
* =--Roles---------------------------------=
* role--built-in--core
#+name: role--built-in--core
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--built-in--core
;;;
<<code--emacs-built-in>>
<<pckg--emacs>>
<<pckg--dired>>
<<pckg--eww>>
<<pckg--org>>
<<pckg--ruby-ts-mode>>
<<pckg--term>>
<<pckg--which-key>>
<<pckg--whitespace>>
#+end_src
* role--built-in--ide
#+name: role--built-in--ide
#+begin_src emacs-lisp :noweb yes
<<pckg--flymake>>
<<pckg--eglot>>
<<pckg--rust-ts-mode>>
(cfg//setup--remap-major-modes)
#+end_src
* =------=
* role--navi--vertico
#+name: role--navi--vertico
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--navi--vertico
;;;
<<pckg--cape>>
<<pckg--consult>>
<<pckg--corfu>>
<<pckg--embark>>
<<pckg--marginalia>>
<<pckg--orderless>>
<<pckg--vertico>>
#+end_src
* role--emacs
#+name: role--emacs
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--emacs
;;;
;;;;; cozy
<<pckg--hydra>>
<<pckg--yasnippet>>
<<suit--emacs-editor>>
<<suit--emacs-media>>
;;;;; org
<<pckg--org-modern>>
(use-package htmlize
  :ensure t
  :pin nongnu)
;;;;; files
;;;;; ui
<<pckg--fontaine>>
<<pckg--spacious-padding>>
<<suit--emacs-view>>
<<pckg--treemacs>>
<<suit--games>>
;;;;;
#+end_src
* role--ide-native
#+name: role--ide-native
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--ide-native
;;;
<<pckg--magit>>
<<pckg--flymake>>
<<pckg--eglot>>
<<pckg--rust-ts-mode>>
<<pckg--d-mode>>
(cfg//setup--remap-major-modes)
#+end_src
* role--ide-lsp
#+name: role--ide-lsp
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--ide-lsp
;;;
<<pckg--magit>>
<<suit--rustic-lsp-flycheck>>
#+end_src
* =------=
* role--experimental
#+name: role--experimental
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--experimental
;;;
<<pckg--popper>>
#+end_src
* role--yard-of-test
#+name: role--yard-of-test
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--yard-of-test
;;;
<<suit--rustic-lsp-flycheck>>
<<pckg--dashboard>>
#+end_src
* =------=
* role--jobs
#+name: role--jobs
#+begin_src emacs-lisp :noweb yes
;;;
;;; role--jobs
;;;
<<code--jobs>>
(if (string-equal cfg/job "assist")
    (u--do-prepare-job-assist))
#+end_src
* =--Packages------------------------------=
* =Built-in=
* pckg--dired
[^]  runs the command dired-up-directory
[C-u S] update variable dired-listing-switches
#+name: pckg--dired
#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :delight "Dir"
  :custom
  (dired-kill-when-opening-new-dired-buffer t)
  ;; (dired-omit-files "^\\..*$") ; Omit the dotfiles
  ;; (dired-omit-files "^\\.$" )
  (dired-isearch-filenames 'dwim)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (dired-listing-switches "-aluFh --group-directories-first -I .")
  (dired-dwim-target t)
  (delete-by-moving-to-trash t)
  ;; Auto refresh Dired, but be quiet about it
  (auto-revert-verbose nil)
  :hook
  (dired-mode . dired-hide-details-mode)
  (dired-mode . auto-revert-mode)
  ;; (dired-mode . dired-omit-mode) ; <C-x M-o> - toggle dired-omit-mode
  :config
  (put 'dired-find-alternate-file 'disabled nil))
#+end_src
* pckg--eglot
#+name: pckg--eglot
#+begin_src emacs-lisp
(use-package eglot
  :ensure nil
  :defer t
  :init
  (defun cfg//manually-activate-flymake ()
    (add-hook 'flymake-diagnostic-functions #'eglot-flymake-backend nil t)
    (flymake-mode 1))
  (defvar-keymap cfg/kmap-eglot
    :doc "lsp eglot."
    :name "Eglot menu"
    "F" 'eglot-format
    "f" 'eglot-code-action-quickfix
    "r" 'eglot-rename
    "<f12>" 'eglot-ensure)
  (keymap-set cfg-hk/craft-map "e" cfg/kmap-eglot)
  (which-key-add-key-based-replacements "C-. e" "Eglot")
  ;; :hook (eglot--managed-mode . cfg//manually-activate-flymake)
  :custom
  (eglot-autoshutdown t)
  ;; :config
  ;; (add-to-list 'eglot-stay-out-of 'flymake)
  )
#+end_src
* pckg--emacs
/Setting up *User* hotkeys/ [[*bind--interactive-user-hotkeys]]
#+name: pckg--emacs
#+begin_src emacs-lisp :noweb yes
(use-package emacs
  :ensure nil
  ;; :init
  ;; (add-to-list 'display-buffer-alist
  ;;              '("\\*rust-analyzer\\*"
  ;;                (display-buffer-in-side-window)
  ;;                (side . right)
  ;;                (slot . 0)
  ;;                (window-width . 80)
  ;;                (window-parameters (no-delete-other-windows . nil))))

  )

;; (use-package desktop
;;   :ensure nil
;;   :custom
;;   (desktop-dirname (cfg/path-u "desktop") "Каталог для хранения файла .desktop.")
;;   ;; (desktop-load-locked-desktop t "Загрузка файла .desktop даже если он заблокирован.")
;;   (desktop-restore-frames t "Восстанавливать фреймы.")
;;   (desktop-save t "Сохранять список открытых буферов, файлов и т. д. без лишних вопросов.")
;;   ;; :hook (after-init . desktop-read)
;;   :config
;;   ;; (desktop-save-mode t)
;;   ;; (add-to-list 'delete-frame-functions 'desktop-save)
;;   (add-to-list 'desktop-modes-not-to-save 'dired-mode))
#+end_src
* pckg--eww
#+name: pckg--eww
#+begin_src emacs-lisp
(use-package eww
  :ensure nil
  :defer t
  :preface
  (defun eww-render-buffer ()
    "Render the current buffer in EWW."
    (interactive)
    (let* ((html (buffer-substring-no-properties (point-min) (point-max)))
           (source (buffer-name))
           (buf (generate-new-buffer (concat "eww: " source))))
      (with-current-buffer buf
        (insert html)
        (goto-char (point-min))
        (eww-display-html 'utf-8 source nil (point-min) buf))
      (switch-to-buffer buf)))
  :config
  (setq eww-search-prefix "https://lite.duckduckgo.com/lite/?q=")
  (keymap-set cfg-hk/open-shelf-map "<f2>"
              '("Руководство по GNU Emacs" .
                (lambda ()(interactive)(eww "https://alexott.net/ru/emacs/emacs-manual/"))))
  (keymap-set cfg-hk/open-shelf-map "<f3>"
              `("Поиск в сети" .
                (lambda ()(interactive)(eww "https://lite.duckduckgo.com/lite"))))
  (keymap-set cfg-hk/open-shelf-map "<f4>"
              '("eww: текущий буфер" .
                eww-render-buffer)))
#+end_src
* pckg--flymake
#+name: pckg--flymake
#+begin_src emacs-lisp
(use-package flymake
  :ensure nil
  :custom
  (flymake-no-changes-timeout 1.2))
  ;; :hook((emacs-lisp-mode . flymake-mode)))
#+end_src
