Config.org
* pckg--treemacs
#+name: pckg--treemacs
#+begin_src emacs-lisp :results silent
(use-package treemacs
  :ensure t
  :requires (ace-window hydra)
  :after (ace-window hydra)
  :defer t
  :init
  (use-package treemacs-all-the-icons
    :ensure t
    :requires (treemacs all-the-icons)
    :if (display-graphic-p)
    )
  :bind (:map cfg-hk/agile-map
              ("t" . treemacs)
              ("C-t" . treemacs-select-window))
  :custom
  (treemacs-show-hidden-files t)
  (treemacs-persist-file (cfg/path-u ".cache/treemacs-persist"))
  :config
  (treemacs-follow-mode t)
  (treemacs-filewatch-mode t)
  (treemacs-fringe-indicator-mode nil)
  (treemacs-git-mode 'simple)
  (treemacs-hide-gitignored-files-mode t)
  (treemacs-project-follow-mode t)
  (treemacs-filewatch-mode t)

  (which-key-add-key-based-replacements "C-c C-p" "treemacs prj")
  (which-key-add-key-based-replacements "C-c C-p c" "collapse")
  (which-key-add-key-based-replacements "C-c C-w" "treemacs wsp"))
(use-package treemacs-magit
  :ensure t
  :defer t
  :after (treemacs magit)
  :requires (treemacs magit)
  )
#+end_src
* pckg--web-mode
#+name: pckg--web-mode
#+begin_src emacs-lisp
(use-package web-mode
  :disabled
  :pin nongnu
  ;; :commands (web-mode)
  :mode
  ("\\.html?\\'" . web-mode)
  ("\\.css\\'" . web-mode)
  ("\\.erb\\'" . web-mode)
  ;; :hook
  ;; (web-mode . company-mode)
  ;; (web-mode . u-hook--web-mode-setup)
  :custom
  (web-mode-enable-css-colorization t)
  (web-mode-enable-engine-detection nil)
  (web-mode-code-indent-offset 2)
  (web-mode-markup-indent-offset 2)
  (web-mode-script-padding 2)
  (web-mode-css-indent-offset 2)
  (web-mode-style-padding 2)
  (put 'web-mode-engine 'safe-local-variable #'stringp)
  (put 'web-mode-engines-alist 'safe-local-variable #'listp))
#+end_src
* pckg--vertico
#+name: pckg--vertico
#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :config
  ;; Different scroll margin
  ;; (setq vertico-scroll-margin 0)
  ;; Show more candidates
  (setq vertico-count 12)
  ;; Grow and shrink the Vertico minibuffer
  (setq vertico-resize t)
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (setq vertico-cycle t)
  (keymap-set vertico-map "C-l" #'vertico-exit)
  (vertico-mode 1))
(use-package vertico-multiform
  :ensure nil
  :config
  (setq vertico-multiform-categories
        '((file grid reverse)
          (consult-location buffer)
          (consult-grep buffer)
          (minor-mode reverse)
          (imenu buffer)
          (emax-sh buffer)
          (t unobtrusive)))
  (setq vertico-multiform-commands '((consult-line (:not posframe))
                                     (t posframe)))
  :hook (after-init . vertico-multiform-mode))
(use-package posframe :ensure t)
(use-package vertico-posframe
  :ensure t
  :requires (vertico posframe)
  :after vertico
  :custom
  (vertico-posframe-parameters '((left-fringe . 8) (right-fringe . 8))))

  #+end_src
* pckg--yasnippet
#+name: pckg--yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :pin gnu
  :delight (yas-minor-mode " Ya")
  :defer t
  :init
  (use-package yasnippet-snippets
    :ensure t
    :pin nongnu
    :requires yasnippet
    :after yasnippet
    )
  :config
  (setq yas-snippet-dirs
      (list (cfg/path "data/snippets") ; personal snippets
            yasnippet-snippets-dir
        ))
  (yas-reload-all)
  (which-key-add-key-based-replacements "C-c &" "Yas")
  :hook ((prog-mode LaTeX-mode org-mode) . yas-minor-mode)
  )
#+end_src
* =Suits=
* suit--emacs-editor
#+name: suit--emacs-editor
#+begin_src emacs-lisp
(use-package ace-window
  :ensure t
  :pin gnu
  :config
  (keymap-global-set "M-o" 'ace-window)
  (setq aw-dispatch-always t)
  )
(use-package delight :ensure t :pin gnu)
(use-package golden-ratio ; auto resize window by golden ratio
  :ensure t
  :pin nongnu
  :delight "GdR"
  ;; :hook (after-init . golden-ratio-mode)
  :custom
  (golden-ratio-exclude-modes '(occur-mode))
  :config
  (with-eval-after-load "which-key"
    (add-to-list 'golden-ratio-inhibit-functions
                 (lambda ()
                   (and which-key--buffer
                        (window-live-p (get-buffer-window which-key--buffer))))))
  (keymap-global-set "C-x #" 'golden-ratio))
(use-package move-text                  ; melpa-stable
  :ensure t                             ; Using the prefix (C-u *number* or META *number*)
  :demand t                             ; you can predefine how many lines move-text will travel.
  :config (move-text-default-bindings))
(use-package rainbow-mode ; colorize color names in buffers
  :ensure t
  :pin gnu
  ;; :delight
  :hook (prog-mode . rainbow-mode))
(use-package rainbow-delimiters                ; highlight brackets according
  :ensure t
  :pin nongnu
  :hook (prog-mode . rainbow-delimiters-mode)) ; to their depth
#+end_src
* suit--emacs-media
#+name: suit--emacs-media
#+begin_src emacs-lisp :results silent
(use-package emms                       ; emacs multimedia service
  :ensure t
  :pin gnu
  :defer t)
;; (use-package gt)   ; language translator
(use-package nov                        ; epub reader
  :ensure t
  :pin nongnu
  :defer t
  :mode ("\\.epub\\'". nov-mode))
(use-package tmr                        ; timers
  :ensure t
  :pin gnu
  :defer t
  :init
  (keymap-set cfg-hk/open-entities-map "t" '("timers" . tmr-tabulated-view))
  :config
  (setq tmr-sound-file (cfg/path "data/sound/alert.ogg")))
#+end_src
* suit--emacs-view
#+name: suit--emacs-view
#+begin_src emacs-lisp :results silent
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p)
  )
(use-package all-the-icons-dired
  :ensure t
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode))
(use-package ef-themes
  :ensure t
  :pin gnu)
#+end_src
* suit--file-extensions
#+name: suit--file-extensions
#+begin_src emacs-lisp
(use-package csv-mode
  :ensure t
  :pin gnu
  :mode "\\.[Cc][Ss][Vv]\\'")
(use-package dockerfile-mode
  :ensure t
  :pin nongnu
  )
(use-package just-mode                  ; melpa-stable
  :ensure t)
(use-package yaml-mode
  :ensure t
  :pin nongnu
  :mode "\\.ya?ml\\'"
  :hook
  (yaml-mode . highlight-indentation-mode)
  :bind
  (:map
   yaml-mode-map
   (">" . nil)))
#+end_src
* suit--games
#+name: suit--games
#+begin_src emacs-lisp :results silent
(use-package mines
  :ensure t
  :pin gnu
  :defer t)
(use-package fireplace                  ; melpa-stable
  :ensure t
  :defer t)
(use-package 2048-game                  ; melpa
  :ensure t
  :defer t)
#+end_src
* suit--rustic-lsp-flycheck
#+name: suit--rustic-lsp-flycheck
#+begin_src emacs-lisp :results silent
(use-package flycheck
  :ensure t
  :hook (after-init . global-flycheck-mode)
  :config
  (keymap-set cfg-hk/craft-map "f" flycheck-command-map)
  (which-key-add-key-based-replacements "C-c !" "Flycheck")
  (which-key-add-key-based-replacements "C-. f" "Flycheck"))
(use-package lsp-mode
  :ensure t
  :init
  (defun cfg//lsp-mode-setup ()
    (keymap-set cfg-hk/craft-map "C-." '("doc glance" . lsp-ui-doc-glance))
    (keymap-set cfg-hk/craft-map "i" '("imenu" . lsp-ui-imenu)))
  :hook (lsp-mode . cfg//lsp-mode-setup)
  :custom (lsp-keymap-prefix "C-c l")
  )
(use-package consult-lsp :ensure t)     ; melpa-stable
(with-eval-after-load 'lsp-mode
  (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration))
(use-package lsp-treemacs
  :ensure t
  :requires (lsp-mode treemacs)
  :after lsp-mode)
(use-package lsp-ui
  :ensure t
  :requires lsp-mode)
(use-package rust-mode
  :ensure t
  :init
  (setq rust-mode-treesitter-derive t))
(use-package rustic
  :ensure t
  :delight "R✧stic!"
  :after rust-mode
  :custom
  (rustic-cargo-use-last-stored-arguments t)
  (rustic-format-on-save t)
  :config
  (which-key-add-key-based-replacements "C-c C-c" "Rustic"))
#+end_src
* suit--rustic-lsp-flycheck2
#+name: suit--rustic-lsp-flycheck
#+begin_src emacs-lisp :results silent
(use-package flycheck
  :ensure t
  :hook (after-init . global-flycheck-mode)
  :config
  (keymap-set cfg-hk/craft-map "f" flycheck-command-map)
  (which-key-add-key-based-replacements "C-c !" "Flycheck")
  (which-key-add-key-based-replacements "C-. f" "Flycheck"))
(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :hook (rustic-mode . lsp-deferred)
  :config
  (lsp-enable-which-key-integration t))
(use-package lsp-treemacs
  :ensure t
  ;; :requires (lsp-mode treemacs)
  :after lsp)
(use-package lsp-ui
  :ensure t
  ;; (:requires lsp-mode)
  :hook (lsp-mode . lsp-ui-mode))
(use-package rustic
  :ensure t
  :delight "R✧stic!"
  :custom
  (rustic-cargo-use-last-stored-arguments t)
  (rustic-format-on-save t)
  :config
  (which-key-add-key-based-replacements "C-c C-c" "Rustic"))
#+end_src
* suit--experimental
#+name: suit--experimental
#+begin_src emacs-lisp :results silent
(setq winner-ring-size 10)              ; default 200
#+end_src
* =Modes=
* mode--killless-mode
#+name: mode--killless-mode
#+begin_src emacs-lisp
;;;
;;; killless-mode
;;;
(defvar backup-confirm-pred nil "Backup for `confirm-kill-emacs' variable.")
(define-minor-mode killless-mode
  "Minor mode for prevent Emacs from accidentally closing."
  :init-value nil
  :global t
  :lighter " ⛨" ; " LLL"

  (if killless-mode
      (progn
        (setq backup-confirm-pred (eval (car (get 'confirm-kill-emacs 'customized-value))))
        (setq confirm-kill-emacs (lambda (&rest args)
                                         (progn
                                           (message "Realy? Emacs is killless!")
                                           nil)))
        (message "killless ON")
        nil)
    (setq confirm-kill-emacs backup-confirm-pred)
    (setq backup-confirm-pred nil)
    (message "killless OFF")
    nil)
  )
#+end_src
* mode--emax-hk-mode
#+name: mode--emax-hk-mode
#+begin_src emacs-lisp :results silent
;;;
;;; emax-hk-mode
;;;
(defvar-keymap emax-hk-mode-map
  :doc "Keymap for emax hotkeys mode."
  :name "name-of-hk-map"
  :prefix 'emax-hk-mode-map-prefix
  "M-j" #'execute-extended-command
  "C-j" #'Control-X-prefix
  "C-;" #'cfg-hk/agile-map-prefix
  "C-." #'cfg-hk/craft-map-prefix
  "<f12>" #'cfg-hk/major-map-prefix)
;; (defcustom emax-hk-translate-keys nil
;;   "Hide the comments too when you do an `hs-hide-all'."
;;   :type 'boolean
;;   :set )
(define-minor-mode emax-hk-mode
  "Minor mode with my emax hotkeys."
  :global t
  :lighter " ⌘" ; 🛠✧✲
  :keymap emax-hk-mode-map
  (if emax-hk-mode
      (progn
        ;; (keymap-set key-translation-map "C-j" "C-x")
        ;; (keymap-set key-translation-map "M-j" "M-x")
        (unless (display-graphic-p)
;;; <C-;> && <C-'> && <C-,> don't working in terminal
;;; <C-/> readed like <C-_>
          (keymap-set key-translation-map ";" "C-;")
          (keymap-set key-translation-map "C-x ;" ";")
          (keymap-set key-translation-map "C-_" "C-/")))
    ;; (keymap-unset key-translation-map "C-j")
    ;; (keymap-unset key-translation-map "M-j")
    (unless (display-graphic-p)
      (keymap-unset key-translation-map ";")
      (keymap-unset key-translation-map "C-x ;")
      (keymap-unset key-translation-map "C-_"))
    ))
#+end_src
* =--Keybindings---------------------------=
* bind--override-standard
#+name: bind--override-standard
#+begin_src emacs-lisp :results silent
(keymap-global-unset "C-x C-c")       ; save-buffers-kill-terminal
(keymap-global-set "C-x x c" 'save-buffers-kill-terminal) ; close emacs
;; (keymap-global-set "C-x C-c" (lambda () (interactive) (message "<C-x C-c> rebind to <C-x x c>")))
(keymap-global-set "C-x C-c" 'kmacro-keymap) ; release <C-x C-k>
(keymap-global-set "C-x C-k" 'kill-current-buffer) ;
;;; <C-;> && <C-'> && <C-,> don't working in terminal
;;; <C-/> readed like <C-_>
(keymap-global-unset "C-z")         ; suspend-frame + <C-x C-z>
(keymap-global-unset "C-?")         ; undo-redo == <C-S-z> + <C-M-_>
(keymap-global-unset "C-/")         ; undo == <C-z> + <C-_>
(keymap-global-unset "M-/")         ; dabbrev-expand
(keymap-global-unset "C-x ;")       ; comment-set-column
(keymap-global-unset "C-x C-;")     ; comment-line == <C-/>
(keymap-global-unset "M-;")         ; comment-dwim == <M-/>
(keymap-global-set "C-z" 'undo)     ;
(keymap-global-set "C-S-z" 'undo-redo)  ; also <C-M-_> (in terminal)
(keymap-global-set "C-/" 'comment-line) ; short comment line
(keymap-global-set "M-/" 'comment-dwim) ; comment endline
(keymap-global-set "M-;" 'dabbrev-expand) ; expand previous word "dynamically"

(keymap-global-set "C-x !" 'shrink-window)
#+end_src
* bind--agile-map
#+name: bind--agile-map
#+begin_src emacs-lisp :results silent
;; Emax minor keymap
(defvar-keymap cfg-hk/agile-map
  :doc "My minor menu on short hand."
  :prefix 'cfg-hk/agile-map-prefix
  "s" '("tab switcher" . tab-switcher)
  "t" '("treemacs" . treemacs)
  "C-e" '("w-right" . windmove-right)
  "C-f" '("w-right" . windmove-right)
  "C-a" '("w-left" . windmove-left)
  "C-b" '("w-left" . windmove-left)
  "C-p" '("w-up" . windmove-up)
  "C-n" '("w-down" . windmove-down))
#+end_src
* bind--craft-map
#+name: bind--craft-map
#+begin_src emacs-lisp :results silent
;; Emax craft keymap
(defvar-keymap cfg-hk/craft-map
  :doc "My craft menu on short hand."
  :prefix 'cfg-hk/craft-map-prefix
  "?" '("help" . (lambda () (interactive) (find-file (cfg/path-s "jotting.org"))))
  )
#+end_src
* bind--major-map
#+name: bind--major-map
#+begin_src emacs-lisp :results silent
;; Emax major keymap
(defvar-keymap cfg-hk/major-map
  :doc "My main menu on long hand."
  :prefix 'cfg-hk/major-map-prefix
  "c" `("configure" . cfg-hk/open-config-map-prefix)
  "o" `("open" . cfg-hk/open-entities-map-prefix)
  ;; "r" `("run". cfg-hk/run-commands-map-prefix)
  "u" `("ui" . cfg-hk/update-ui-map-prefix)
  "k" '("kill less" . killless-mode)
  "C-c" '("close emacs" .  save-buffers-kill-terminal)
  "<f12>" `("shelf" . cfg-hk/open-shelf-map-prefix))
#+end_src
