init.el
(defvar backup-confirm-pred nil "Backup for `confirm-kill-emacs' variable.")
(define-minor-mode killless-mode
  "Minor mode for prevent Emacs from accidentally closing."
  :init-value nil
  :global t
  :lighter " ⛨" ; " LLL"

  (if killless-mode
      (progn
        (setq backup-confirm-pred (eval (car (get 'confirm-kill-emacs 'customized-value))))
        (setq confirm-kill-emacs (lambda (&rest args)
                                         (progn
                                           (message "Realy? Emacs is killless!")
                                           nil)))
        (message "killless ON")
        nil)
    (setq confirm-kill-emacs backup-confirm-pred)
    (setq backup-confirm-pred nil)
    (message "killless OFF")
    nil)
  )
;;; remap keybindings
(defvar-keymap cfg-hk/open-config-map
  :doc "Config"
